{
  "translations": {
    "Is it possible to Expose a REST API in OutSystems?": "OutSystems에서 REST API를 노출(Expose)하는 것이 가능합니까?",
    "Select the correct option regarding the Input Widget.": "Input 위젯에 대한 올바른 옵션을 선택하세요.",
    "In Rich Widgets, the List_Navigation widget…..": "Rich Widget에서 List_Navigation 위젯은...",
    "Regarding Expression on the screen, which of the following options is true?": "화면의 Expression에 대해 다음 중 옳은 것은 무엇입니까?",
    "Style classes can be overriden, so if you have the same style class defined in a Web Block, a Screen, and the Theme, which definition is applied?": "스타일 클래스는 재정의될 수 있습니다. Web Block, Screen, Theme에 동일한 스타일 클래스가 정의된 경우 어떤 정의가 효율적입니까?",
    "When doing a \"With or Without\" join between tow entities, it returns..": "두 엔티티 간에 \"With or Without\" 조인을 수행하면 무엇을 반환합니까?",
    "Regarding List_SortColumn, which of the following options is true?": "List_SortColumn에 대해 다음 중 옳은 것은 무엇입니까?",
    "Entities and Attributes are created in the database as...": "엔티티와 속성은 데이터베이스에서 무엇으로 생성됩니까?",
    "To speed up application development, OutSystems has pre-built screens with logic and data for typical scenarios": "애플리케이션 개발 속도를 높이기 위해 OutSystems는 일반적인 시나리오를 위한 로직과 데이터가 포함된 사전 제작된 화면을 제공합니다.",
    "The Check Box widget is bound to a Variable of type.": "Check Box 위젯은 어떤 유형의 변수에 바인딩됩니까?",
    "Consider a Web Screen with a Button that is associated to a Screen Action. An Ajax Refresh statement in that Screen Action allows to refresh part of that Web Screen, ...": "Screen Action과 연결된 버튼이 있는 웹 화면을 고려하세요. 해당 Screen Action의 Ajax Refresh 구문은 웹 화면의 일부를 새로 고칠 수 있도록 허용합니다...",
    "When you want to display a widget in a certain role, what is the best way?": "특정 역할(Role)에서 위젯을 표시하고 싶을 때 가장 좋은 방법은 무엇입니까?",
    "Output parameters are available ...": "출력 매개변수(Output parameters)를 사용할 수 있는 범위는...",
    "Regarding Web Blocks in Outsystems, select to statement that is true.": "OutSystems의 Web Block에 대해 다음 중 옳은 문장을 선택하세요.",
    "When the desired data type is Currency, the following data type transmission does not occur(error)": "원하는 데이터 유형이 Currency인 경우, 다음 중 발생하지 않는 데이터 유형 전송(오류)은 무엇입니까?",
    "What is the correct syntax for writing names of Entities and Entity Attributes in SQL Query": "SQL 쿼리에서 엔티티 및 엔티티 속성 이름을 작성하는 올바른 구문은 무엇입니까?",
    "What types of applications can be created in OutSystems?": "OutSystems에서 어떤 유형의 애플리케이션을 생성할 수 있습니까?",
    "What is the output of an aggregate when no records meet the criteria?": "기준을 충족하는 레코드가 없을 때 Aggregate의 출력은 무엇입니까?",
    "The Check Box widget is bound to a Variable of type...": "Check Box 위젯은 다음 유형의 변수에 바인딩됩니다...",
    "Create unique customer index with 2 fields Name and Email. When performing any insert data below, an error will occur": "Name과 Email 두 필드로 고유한 고객 인덱스를 생성합니다. 아래 데이터를 삽입할 때 오류가 발생하는 경우는 언제입니까?",
    "Regarding exposing elements in Producer modules...": "Producer 모듈의 요소를 노출(Expose)하는 것과 관련하여...",
    "To restrict access to a Web Screen...": "웹 화면에 대한 액세스를 제한하려면...",
    "A Theme defines the look and feel of application Screens and you can directly apply it to ...": "Theme은 애플리케이션 화면의 모양과 느낌을 정의하며, 다음에 직접 적용할 수 있습니다...",
    "Regarding property Escape Content of Expression, which of the following options is true?": "Expression of Escape Content 속성에 대해 다음 중 옳은 것은 무엇입니까?",
    "Regarding Session Variable, which of the following options is true?": "세션 변수(Session Variable)에 대해 다음 중 옳은 것은 무엇입니까?",
    "To create a List screen and then a Detail screen...": "목록 화면(List screen)을 만든 다음 상세 화면(Detail screen)을 만들려면...",
    "In any case, should use Site property": "어떤 경우에 Site 속성을 사용해야 합니까?",
    "A Structure can have attributes of the following data types:": "Structure는 다음과 같은 데이터 유형의 속성을 가질 수 있습니다:",
    "Style load order": "스타일 로드 순서",
    "Regarding Preparation in Outsystems, select to statement that is true.": "OutSystems의 Preparation에 대해 옳은 문장을 선택하세요.",
    "Roles are created in applications and user authorizations are managed...": "애플리케이션에서 역할(Role)이 생성되고 사용자 권한이 관리됩니다...",
    "When consuming a REST service, what callback action should be used to customize a request sent to the external service?": "REST 서비스를 소비할 때 외부 서비스로 전송되는 요청을 사용자 정의하기 위해 어떤 콜백 액션을 사용해야 합니까?",
    "When there is a change in the Producer module, which statement later about the Consumer module is correct.": "Producer 모듈에 변경 사항이 있을 때, Consumer 모듈에 대한 설명으로 옳은 것은 무엇입니까?",
    "Inside the Preparation of Web Screen, the Destination statement...": "웹 화면의 Preparation 내에서 Destination 문은...",
    "Consider that you want to change your application Header, with new fonts, colors and an icon. What is the best approach to accomplish that in Outsystems?": "새로운 글꼴, 색상 및 아이콘으로 애플리케이션 헤더를 변경하고 싶다고 가정해 보세요. OutSystems에서 이를 달성하기 위한 가장 좋은 방법은 무엇입니까?",
    "XXX screen only Registered role is checked, which of the following statements is true?": "XXX 화면에 Registered 역할만 체크되어 있는 경우, 다음 중 옳은 것은 무엇입니까?",
    "Regarding a Consumer module": "Consumer 모듈과 관련하여",
    "Give 1 aggregate as shown. Ask how to display the average score of the group according to Point1 and sort the order of Point 2 with the highest score by year": "예시로 제시된 Aggregate가 있습니다. 그룹별 Point 1의 평균 점수를 표시하고 Point 2의 최고 점수를 연도별로 정렬하는 방법은 무엇입니까?",
    "To replace data on a widget with automatic data replacement (Tables Records, List Records, Form,...)": "위젯의 데이터를 자동 데이터 교체(Table Records, List Records, Form 등)로 대체하려면...",
    "When an OnParameterChange event will trigger?": "OnParameterChange 이벤트는 언제 트리거됩니까?",
    "If in an entity, a reference attribute is defined with protect rule then what is the correct statement?": "엔티티에서 참조 속성이 Protect 규칙으로 정의된 경우 올바른 설명은 무엇입니까?",
    "Which of the following is not possible to fetch when the screen is initializing?": "화면이 초기화될 때 다음 중 가져올 수 없는 것은 무엇입니까?",
    "Why should we not call multiple server actions in one client action?": "하나의 클라이언트 액션에서 여러 서버 액션을 호출하면 안 되는 이유는 무엇입니까?",
    "Choose the correct option associated with the below ERD?": "아래 ERD와 관련된 올바른 옵션을 선택하세요.",
    "Is it possible to define entity identifier other then LongInteger data type?": "LongInteger 데이터 유형 이외의 엔티티 식별자를 정의할 수 있습니까?",
    "Which of the following is true about the 'On Render' event?": "'On Render' 이벤트에 대해 다음 중 옳은 것은 무엇입니까?",
    "Which statement about entities is false?": "엔티티에 대한 설명 중 틀린 것은 무엇입니까?",
    "Which of the option below is true when any of the mandatory input's valid property is false?": "필수 입력의 Valid 속성이 false인 경우 다음 중 옳은 것은 무엇입니까?",
    "A client action is set to its public and function property set to \"NO\", This action can be....": "클라이언트 액션의 Public 및 Function 속성이 \"NO\"로 설정된 경우, 이 액션은...",
    "What would be the value of FinalValue in the below logic?": "아래 로직에서 FinalValue의 값은 무엇이 됩니까?",
    "When the built-in validation is set to true, in which condition form will be submitted?": "내장 유효성 검사(Built-in validation)가 true로 설정된 경우, 폼은 어떤 조건에서 제출됩니까?",
    "If there are 2 entities, User and UserDetail. If one UserDetail belongs to only one User, how can we create the one-to-One mapping between them?": "User와 UserDetail 두 엔티티가 있습니다. 하나의 UserDetail이 하나의 User에만 속하는 경우, 이들 간의 일대일 매핑을 어떻게 생성할 수 있습니까?",
    "We need to check if a specific element is present in the list, which list method would be used?": "리스트에 특정 요소가 있는지 확인해야 할 때 어떤 리스트 메서드를 사용합니까?",
    "Which of the following can be set as a datatype of site property?": "다음 중 Site 속성의 데이터 유형으로 설정할 수 있는 것은 무엇입니까?",
    "Which programming concept is similar to the static entity?": "어떤 프로그래밍 개념이 정적 엔티티(Static Entity)와 유사합니까?",
    "On which type of variable we can apply for each loop?": "어떤 유형의 변수에 For Each 루프를 적용할 수 있습니까?",
    "What is wrong in respect of the LINK widget onClick event?": "LINK 위젯의 onClick 이벤트와 관련하여 잘못된 것은 무엇입니까?",
    "What is the \"function\" property of client and server action?": "클라이언트 및 서버 액션의 \"function\" 속성은 무엇입니까?",
    "Which is false regarding the Static entities?": "정적 엔티티(Static entities)에 대해 틀린 것은 무엇입니까?",
    "What is \"Expose Read Only\" in respect of entity?": "엔티티의 \"Expose Read Only\" 속성은 무엇을 의미합니까?",
    "To ensure that the incorrect data doesn't reach the server, what is to be done? Note: Built-In validation property is set to True?": "잘못된 데이터가 서버에 도달하지 않도록 하려면 어떻게 해야 합니까? (참고: Built-In validation 속성이 True로 설정됨)",
    "Which of the following is true with respect to the below screen setting?": "아래 화면 설정과 관련하여 다음 중 옳은 것은 무엇입니까?",
    "What would be the execution order of data action and screen aggregates while loading any screen?": "화면을 로드할 때 데이터 액션과 화면 애그리게이트의 실행 순서는 어떻게 됩니까?",
    "If there are 2 entities, User and Group. If one User belongs to only one Group, how can we create the one-to-many mapping between them?": "User와 Group 두 엔티티가 있습니다. 한 명의 User가 하나의 Group에만 속하는 경우, 이들 간의 일대다 매핑을 어떻게 생성할 수 있습니까?",
    "Which of the following mappings between Outsystems and the database NOT is correct?": "OutSystems와 데이터베이스 간의 매핑 중 옳지 않은 것은 무엇입니까?",
    "Which of the below options can not be used inside an expression?": "다음 옵션 중 Expression 내부에서 사용할 수 없는 것은 무엇입니까?",
    "Which is wrong in respect of buttons?": "버튼과 관련하여 틀린 설명은 무엇입니까?",
    "What will happen when we set the function property of public server action as \"Yes\"?": "공용 서버 액션의 function 속성을 \"Yes\"로 설정하면 어떻게 됩니까?",
    "What is true in respect of the web blocks?": "웹 블록(Web blocks)과 관련하여 옳은 것은 무엇입니까?",
    "Regarding Blocks in OutSystems reactive apps, which of the following options is correct?": "OutSystems 반응형 앱의 블록에 대해 다음 중 옳은 옵션은 무엇입니까?",
    "Which of the below option is true regarding CreateOrUpdate entity action?": "CreateOrUpdate 엔티티 액션에 대해 다음 중 옳은 것은 무엇입니까?",
    "Which of the following is true?": "다음 중 옳은 것은 무엇입니까?",
    "What is correct in respect of screen actions?": "화면 액션(Screen actions)과 관련하여 옳은 것은 무엇입니까?"
  },
  "option_translations": {
    "Yes": "예",
    "No": "아니요",
    "All input widgets must be inside a Form widget.": "모든 input 위젯은 Form 위젯 안에 있어야 합니다.",
    "You don't need to have a variable. The data typed by the user is saved in the Input widget itself.": "변수가 필요하지 않습니다. 사용자가 입력한 데이터는 Input 위젯 자체에 저장됩니다.",
    "It can only be associated to variables of Text data type.": "Text 데이터 유형의 변수에만 연결할 수 있습니다.",
    "You always need to have a variable to store the value typed by the user.": "사용자가 입력한 값을 저장하려면 항상 변수가 필요합니다.",
    "Is a navigator for a Table Records with multiple pages, showing a defined number of elements per page.": "페이지당 정의된 수의 요소를 표시하는 여러 페이지가 있는 Table Records의 네비게이터입니다.",
    "Is a navigator for a Form with multiple pages, showing a defined number of elements per page.": "페이지당 정의된 수의 요소를 표시하는 여러 페이지가 있는 Form의 네비게이터입니다.",
    "Expression can call server action and use the server action output to calculate": "Expression은 서버 액션을 호출하고 서버 액션 출력을 사용하여 계산할 수 있습니다.",
    "If the expression is empty, the value shown in the Example property will be displayed": "Expression이 비어 있으면 Example 속성에 표시된 값이 표시됩니다.",
    "The value of Expression will be calculated during the build screen and displayed on the screen": "Expression 값은 화면 빌드 중에 계산되어 화면에 표시됩니다.",
    "Expression cannot call server action and uses server action output to calculate": "Expression은 서버 액션을 호출할 수 없으며 서버 액션 출력을 사용하여 계산합니다.",
    "The one in the Web Block.": "Web Block에 있는 것.",
    "The one in the Screen.": "Screen에 있는 것.",
    "The one in the Theme.": "Theme에 있는 것.",
    "The one in the UI Flow.": "UI Flow에 있는 것.",
    "All records from both entities(FULL OUTER JOIN)": "두 엔티티의 모든 레코드(FULL OUTER JOIN)",
    "Only records where there is match between the tow entities(INNER JOIN)": "두 엔티티 간에 일치하는 레코드만(INNER JOIN)",
    "All records from the left entity even if there is no match in the right entity(LEFT JOIN)": "오른쪽 엔티티에 일치하는 것이 없더라도 왼쪽 엔티티의 모든 레코드(LEFT JOIN)",
    "All records from the right entity even if there is no match in the left entity(RIGHT JOIN)": "왼쪽 엔티티에 일치하는 것이 없더라도 오른쪽 엔티티의 모든 레코드(RIGHT JOIN)",
    "Set the Column to '{EntityName}.[AttributeName]' & define a dynamic sort": "Column을 '{EntityName}.[AttributeName]'으로 설정하고 동적 정렬을 정의합니다.",
    "Set the Column to '{EntityName}.[AttributeName]' & Automatic add a dynamic sort": "Column을 '{EntityName}.[AttributeName]'으로 설정하고 동적 정렬을 자동으로 추가합니다.",
    "Set the Column to '{EntityName}.{AttributeName}' & define a dynamic sort": "Column을 '{EntityName}.{AttributeName}'으로 설정하고 동적 정렬을 정의합니다.",
    "Set the Column to '{EntityName}.{AttributeName}' & Automatic add a dynamic sort": "Column을 '{EntityName}.{AttributeName}'으로 설정하고 동적 정렬을 자동으로 추가합니다.",
    "Tables and Columns": "테이블 및 컬럼",
    "Tables and Indexes": "테이블 및 인덱스",
    "Indexes and Columns": "인덱스 및 컬럼",
    "Tables and Constraints": "테이블 및 제약 조건",
    "TRUE": "참",
    "FALSE": "거짓",
    "Text": "텍스트",
    "Integer": "정수",
    "Boolean": "불리언",
    "Date": "날짜",
    "if the button has Method Navigate.": "버튼의 Method가 Navigate인 경우.",
    "regardless of the Button's Method.": "버튼의 Method에 관계없이.",
    "if the Button has Method Ajax Submit.": "버튼의 Method가 Ajax Submit인 경우.",
    "if the Button has Method Submit.": "버튼의 Method가 Submit인 경우.",
    "The widget's Visible property setting is Check < RoleName> Role (UserId) = True": "위젯의 Visible 속성 설정이 Check < RoleName> Role (UserId) = True인 경우",
    "Use Container to display control with Display property as Check < RoleName> Role (UserId) = True": "Display 속성이 Check < RoleName> Role (UserId) = True인 컨테이너를 사용하여 컨트롤을 표시합니다.",
    "Use the If condition to display control provided that Check < RoleName> Role (UserId) = True": "Check < RoleName> Role (UserId) = True인 경우 컨트롤을 표시하기 위해 If 조건을 사용합니다.",
    "Cannot perform the display in units of each widget, so it cannot be done": "각 위젯 단위로 표시를 수행할 수 없으므로 불가능합니다.",
    "Only inside their implementation scope.": "해당 구현 범위 내에서만.",
    "Only outside their implementation scope.": "해당 구현 범위 밖에서만.",
    "Both inside and outside their implementation scope.": "구현 범위 안팎 모두.",
    "Web Block can only have 1 output": "Web Block은 하나의 출력만 가질 수 있습니다.",
    "Web Block cannot have preparation action": "Web Block은 Preparation 액션을 가질 수 없습니다.",
    "Web Block can Preparation action": "Web Block은 Preparation 액션을 가질 수 있습니다.",
    "Web Block can have multiple outputs": "Web Block은 여러 출력을 가질 수 있습니다.",
    "Decimal, Integer, Long Integer": "Decimal, 정수, Long Integer",
    "Long Integer, Integer, Boolean, Entity Identifier(Integer)": "Long Integer, 정수, 불리언, 엔티티 식별자(정수)",
    "Decimal, Long Integer, Boolean, Entity Identifier(Integer)": "Decimal, Long Integer, 불리언, 엔티티 식별자(정수)",
    "Decimal, Integer, Boolean, Entity Identifier(Integer)": "Decimal, 정수, 불리언, 엔티티 식별자(정수)",
    "<Entity> and <Entity>.[Attribute]": "<Entity> 및 <Entity>.[Attribute]",
    "{Entity} and {Entity}.[Attribute]": "{Entity} 및 {Entity}.[Attribute]",
    "{Entity} and {Entity}.{Attribute}": "{Entity} 및 {Entity}.{Attribute}",
    "<Entity> and <Entity>.<Attribute>": "<Entity> 및 <Entity>.<Attribute>",
    "Web, Mobile and Service": "웹, 모바일 및 서비스",
    "Web, Mobile, Service and Extension": "웹, 모바일, 서비스 및 익스텐션",
    "Module and Extension": "모듈 및 익스텐션",
    "Only Web": "웹 전용",
    "Null List": "Null 리스트",
    "Empty list": "빈 리스트",
    "List has an empty record": "리스트에 빈 레코드가 있음",
    "List has a record with default data": "리스트에 기본 데이터가 포함된 레코드가 있음",
    "(Jonh,jonh@gmail.com,1122),(Jonh_Hand,jonh@gmail.com,1122)": "(John, john@gmail.com, 1122), (John_Hand, john@gmail.com, 1122)",
    "(Jonh,jonh@gmail.com,1122),(Jonh,jonh_hand@gmail.com,1122)": "(John, john@gmail.com, 1122), (John, john_hand@gmail.com, 1122)",
    "(Jonh,jonh@gmail.com,1122),(Jonh_Hand,jonh@gmail.com,3344)": "(John, john@gmail.com, 1122), (John_Hand, john@gmail.com, 3344)",
    "(Jonh,jonh@gmail.com,1122),(Jonh,jonh@gmail.com,3344)": "(John, john@gmail.com, 1122), (John, john@gmail.com, 3344)",
    "Any element can be exposed, and reused, but only by modules of the same application.": "모든 요소를 노출하고 재사용할 수 있지만 동일한 애플리케이션의 모듈에서만 가능합니다.",
    "Any element can be exposed, and reused by modules of any application.": "모든 요소를 노출하고 어떤 애플리케이션의 모듈에서도 재사용할 수 있습니다.",
    "Only elements with the Public property set to Yes can be exposed and reused by modules of any application.": "Public 속성이 Yes로 설정된 요소만 어떤 애플리케이션의 모듈에서도 노출 및 재사용할 수 있습니다.",
    "Only elements with the Public property set to Yes can be exposed and reused, but only by modules of the same application.": "Public 속성이 Yes로 설정된 요소만 노출 및 재사용할 수 있지만 동일한 애플리케이션의 모듈에서만 가능합니다.",
    "Go to the Users application and associate the Web Screen to a specific role.": "Users 애플리케이션으로 이동하여 웹 화면을 특정 역할에 연결합니다.",
    "Select the Role in the Web Screen Properties pane and OutSystems will automatically check the Role at runtime.": "웹 화면 속성 창에서 역할을 선택하면 OutSystems가 런타임에 자동으로 역할을 확인합니다.",
    "A Module, a UI Flow, or an individual Screen or Web Block.": "모듈, UI Flow 또는 개별 화면이나 Web Block.",
    "A Module, a UI Flow, or an individual Screen.": "모듈, UI Flow 또는 개별 화면.",
    "A Module or a UI Flow.": "모듈 또는 UI Flow.",
    "Only the Module.": "모듈에만.",
    "When set to No, the result returns exactly as the result of the formula": "No로 설정된 경우 결과는 공식의 결과와 똑같이 반환됩니다.",
    "When set to Yes, the result returns exactly as the result of the formula": "Yes로 설정된 경우 결과는 공식의 결과와 똑같이 반환됩니다.",
    "When the value is No, the special characters in the returned result have been replaced by characters that do not affect the protocol being used.": "값이 No인 경우 반환된 결과의 특수 문자는 사용 중인 프로토콜에 영향을 주지 않는 문자로 대체되었습니다.",
    "The default value is No": "기본값은 No입니다.",
    "Set persistent property to true, the session can be shared for the entire system to use": "Persistent 속성을 true로 설정하면 세션이 전체 시스템에서 사용될 수 있도록 공유될 수 있습니다.",
    "Session variables can only use basic data types (Integer, Text, Boolean,...)": "세션 변수는 기본 데이터 유형(정수, 텍스트, 불리언 등)만 사용할 수 있습니다.",
    "The session variable will expire when the session times out": "세션이 타임아웃되면 세션 변수가 만료됩니다.",
    "Set Cache property to store session value after user log out": "로그아웃 후에 세션 값을 저장하려면 Cache 속성을 설정합니다.",
    "Drag and drop an Entity to the UI Flow and it automatically creates the List and Detail Screens.": "엔티티를 UI Flow로 드래그 앤 드롭하면 목록 화면과 상세 화면이 자동으로 생성됩니다.",
    "Drag and drop an Entity to the UI Flow to create the List Screen and repeat it to create the Detail Screen.": "엔티티를 UI Flow로 드래그 앤 드롭하여 목록 화면을 생성하고, 상세 화면을 생성하기 위해 이 과정을 반복합니다.",
    "Minimum password length": "최소 비밀번호 길이",
    "Number of logged user": "로그인한 사용자 수",
    "Search field value": "검색 필드 값",
    "Basic, Complex, and Record": "기본, 복합 및 레코드",
    "Basic, String, and Object": "기본, 문자열 및 객체",
    "Basic, Structure, Entity, and List": "기본, 구조체, 엔티티 및 리스트",
    "Basic and List only": "기본 및 리스트 전용",
    "Screen & Email -> Web block -> theme": "화면 및 이메일 -> Web block -> Theme",
    "theme -> Web block -> Screen & Email": "Theme -> Web block -> 화면 및 이메일",
    "Web block -> theme -> Screen & Email": "Web block -> Theme -> 화면 및 이메일",
    "Preparation action may have multiple outputs": "Preparation 액션은 여러 출력을 가질 수 있습니다.",
    "Preparation is a forced action of Screen and webBlock": "Preparation은 화면 및 webBlock의 필수 액션입니다.",
    "The preparation action can only have 1 output": "Preparation 액션은 하나의 출력만 가질 수 있습니다.",
    "Screen may not need Preparation": "화면은 Preparation이 필요하지 않을 수 있습니다.",
    "Manually in the Users application or programmatically.": "Users 애플리케이션에서 수동으로 또는 프로그래밍 방식으로.",
    "Only manually in the Users application.": "Users 애플리케이션에서 수동으로만.",
    "Only programmatically using the Grant... and Revoke... role actions.": "Grant... 및 Revoke... 역할 액션을 사용하여 프로그래밍 방식으로만.",
    "On Consume": "On Consume",
    "On Before Request": "On Before Request",
    "On After Response": "On After Response",
    "On REST Request": "On REST Request",
    "When adding the output of Server action, the consumer will get an error if the Producer is not updated": "서버 액션의 출력을 추가할 때 Producer가 업데이트되지 않으면 Consumer에서 오류가 발생합니다.",
    "When changing the internal logic of a server action without changing the input-output, Consumer still uses the latest logic": "입출력을 변경하지 않고 서버 액션의 내부 로직을 변경할 때 Consumer는 여전히 최신 로직을 사용합니다.",
    "When deleting the input of the Server action, the consumer will get an error if the Producer is not updated": "서버 액션의 입력을 삭제할 때 Producer가 업데이트되지 않으면 Consumer에서 오류가 발생합니다.",
    "When changing the content of the web screen, the Consumer is still not affected even without updating Producer": "웹 화면의 콘텐츠를 변경할 때 Consumer는 Producer를 업데이트하지 않아도 영향을 받지 않습니다.",
    "allows redirecting the user to a different Web Screen, without rendering the current Screen.": "현재 화면을 렌더링하지 않고 사용자를 다른 웹 화면으로 리디렉션할 수 있습니다.",
    "renders the Current Screen and afterwards the users is redirected to the Destination Screen.": "현재 화면을 렌더링한 후 사용자가 Destination 화면으로 리디렉션됩니다.",
    "prompts the user before redirecting to the Destination Web Screen": "Destination 웹 화면으로 리디렉션하기 전에 사용자에게 확인 메시지를 표시합니다.",
    "Change the Common/Header Web Block, by adding a Container with the new icon. Add the new CSS to the Module Theme's Style Sheet.": "새 아이콘이 있는 컨테이너를 추가하여 Common/Header Web Block을 변경합니다. 모듈 Theme의 스타일 시트에 새 CSS를 추가합니다.",
    "Add the new CSS to the Style Sheet of every Web Screens in the application, overriding the Style Sheet of the Common/Header Web Block Replace the Header_Logo with the new icon.": "애플리케이션의 모든 웹 화면 스타일 시트에 새 CSS를 추가하고 Common/Header Web Block의 스타일 시트를 무시하며 Header_Logo를 새 아이콘으로 교체합니다.",
    "Change the Style Sheet of the Common/Header Web Block, with the new CSS implemented and replace the Header_Logo with the new icon.": "새 CSS가 구현된 상태에서 Common/Header Web Block의 스타일 시트를 변경하고 Header_Logo를 새 아이콘으로 교체합니다.",
    "Replace the Common/Header Web Block on every Web Screen with a new Web Block containing the new icon and CSS in its Style Sheet.": "모든 웹 화면의 Common/Header Web Block을 새 아이콘과 CSS가 포함된 새 Web Block으로 교체합니다.",
    "User has not logged in, make request Screen XXX. As a result, can not permission": "사용자가 로그인하지 않고 XXX 화면을 요청했습니다. 결과적으로 권한을 가질 수 없습니다.",
    "User logged, make request Screen XXX. As a result, can not permission": "사용자가 로그인했지만 XXX 화면을 요청했습니다. 결과적으로 권한을 가질 수 없습니다.",
    "It can only reuse elements from Producer modules of the same application.": "동일한 애플리케이션의 Producer 모듈 요소만 재사용할 수 있습니다.",
    "It can only reuse elements that are Public in their Producer modules.": "Producer 모듈에서 Public으로 설정된 요소만 재사용할 수 있습니다.",
    "It can reuse any element from any Producer module.": "모든 Producer 모듈의 모든 요소를 재사용할 수 있습니다.",
    "It can only reuse elements from Producer modules of other applications.": "다른 애플리케이션의 Producer 모듈 요소만 재사용할 수 있습니다.",
    "Use the GROUPBY function according to the Year attribute, then perform the AVERAGE function for the Point 1 attribute and MAX for the attribute for Point 2.": "연도 속성에 따라 GROUPBY 함수를 사용한 다음, Point 1 속성에 대해 AVERAGE 함수를, Point 2 속성에 대해 MAX 함수를 수행합니다.",
    "Use the GROUPBY function according to the Group attribute, then perform the AVERAGE function for the Point 1 attribute and MAX for the attribute for Point 2.": "그룹 속성에 따라 GROUPBY 함수를 사용한 다음, Point 1 속성에 대해 AVERAGE 함수를, Point 2 속성에 대해 MAX 함수를 수행합니다.",
    "Use the GROUPBY function according to the Year attribute, then perform the AVERAGE function for the Point 2 attribute and MAX for the Point 1 attribute.": "연도 속성에 따라 GROUPBY 함수를 사용한 다음, Point 2 속성에 대해 AVERAGE 함수를, Point 1 속성에 대해 MAX 함수를 수행합니다.",
    "Use the GROUPBY function according to the Group attribute, then perform the AVERAGE function for the Point 2 attribute and MAX for the attribute for Point 1.": "그룹 속성에 따라 GROUPBY 함수를 사용한 다음, Point 2 속성에 대해 AVERAGE 함수를, Point 1 속성에 대해 MAX 함수를 수행합니다.",
    "Right-click on the widget and select Import Data from Entity": "위젯을 마우스 오른쪽 버튼으로 클릭하고 엔티티에서 데이터 가져오기를 선택합니다.",
    "Delete the widget and create it again with the right Entities.": "위젯을 삭제하고 올바른 엔티티로 다시 생성합니다.",
    "Drag your Entity and drop it onto the widget.": "엔티티를 위젯 위로 드래그 앤 드롭합니다.",
    "Right-click on the Entity and select Import Data from Excel.": "엔티티를 마우스 오른쪽 버튼으로 클릭하고 엑셀에서 데이터 가져오기를 선택합니다.",
    "When the block changes the value of any input parameter of itself.": "블록이 자신의 입력 매개변수 값을 변경할 때.",
    "When the parent of the block or block itself changes the value of the block's input parameter.": "블록의 부모나 블록 자체가 블록의 입력 매개변수 값을 변경할 때.",
    "When the parent of the block changes the value of any of the block's input parameters.": "블록의 부모가 블록의 입력 매개변수 값을 변경할 때.",
    "If the value of a Block's Input Parameters changes inside a Client Action of the Block.": "블록의 클라이언트 액션 내부에서 블록의 입력 매개변수 값이 변경되는 경우.",
    "It would not allow deleting rows from the parent entity in case of reference data is available in the child table.": "자식 테이블에 참조 데이터가 있는 경우 부모 엔티티에서 행을 삭제할 수 없습니다.",
    "It would protect entities from cyber attacks.": "사이버 공격으로부터 엔티티를 보호합니다.",
    "It would not allow deletion row from the parent table in every case.": "모든 경우에 부모 테이블에서 행을 삭제할 수 없습니다.",
    "It would protect the entity to perform a delete operation on itself.": "자체적으로 삭제 작업을 수행하도록 엔티티를 보호합니다.",
    "Advanced SQL in the screen level": "화면 수준에서의 Advanced SQL",
    "Aggregates in the screen level.": "화면 수준에서의 Aggregate",
    "Aggregates inside the data action flow": "데이터 액션 흐름 내의 Aggregate",
    "Rest API in the data action flow.": "데이터 액션 흐름 내의 Rest API",
    "Because there is a risk of cyber-attacks?": "사이버 공격의 위험이 있기 때문입니까?",
    "It gives a performance problem and may slow down the application processing": "성능 문제를 일으키고 애플리케이션 처리 속도를 늦출 수 있습니다.",
    "It can cause incorrect data operation.": "잘못된 데이터 작업을 유발할 수 있습니다.",
    "It can cause data issues.": "데이터 문제를 유발할 수 있습니다.",
    "OrderType Can not have SellOrderId attribute": "OrderType은 SellOrderId 속성을 가질 수 없습니다.",
    "No mapping can be formed between both entities.": "두 엔티티 사이에 매핑을 형성할 수 없습니다.",
    "OrderType should be a normal entity.": "OrderType은 일반 엔티티여야 합니다.",
    "SellOrder can not have OrderType attribute.": "SellOrder는 OrderType 속성을 가질 수 없습니다.",
    "Yes, But it can be only Text, Integer, LongInteger, and Entity Identifier": "예, 하지만 텍스트, 정수, LongInteger 및 엔티티 식별자만 가능합니다.",
    "Yes, but it can be only EntityIdentifier": "예, 하지만 엔티티 식별자만 가능합니다.",
    "It triggered before the onReady event.": "onReady 이벤트 이전에 트리거됩니다.",
    "It is the first event to be triggered when we navigate from one screen to other.": "한 화면에서 다른 화면으로 이동할 때 트리거되는 첫 번째 이벤트입니다.",
    "It runs every time when there is any change in the data on the screen.": "화면 데이터에 변경 사항이 있을 때마다 실행됩니다.",
    "It runs only once after the page is ready.": "페이지가 준비된 후 한 번만 실행됩니다.",
    "Entities do not require an Identifier": "엔티티는 식별자가 필요하지 않습니다.",
    "Entities can be deleted": "엔티티는 삭제될 수 있습니다.",
    "Entities can be set as multitenant": "엔티티는 멀티테넌트로 설정될 수 있습니다.",
    "Entities are stored in memory": "엔티티는 메모리에 저장됩니다.",
    "Form.valid will be true.": "Form.valid가 true가 됩니다.",
    "We would require to set form.valid property false explicitly.": "form.valid 속성을 명시적으로 false로 설정해야 합니다.",
    "Form.valid will be unchanged.": "Form.valid가 변경되지 않습니다.",
    "The form's valid property will automatically be set to false.": "폼의 valid 속성이 자동으로 false로 설정됩니다.",
    "Can be called a Screen Action.": "화면 액션(Screen Action)으로 호출될 수 있습니다.",
    "Can be called from a Server Action.": "서버 액션(Server Action)에서 호출될 수 있습니다.",
    "Can be used in an Expression": "Expression에서 사용할 수 있습니다.",
    "Can be called from other modules.": "다른 모듈에서 호출될 수 있습니다.",
    "FinalValue will be the default value or equal to the 'Value'.": "FinalValue는 기본값이거나 'Value'와 같습니다.",
    "The FinalValue will be the default value assigned to it.": "FinalValue는 할당된 기본값입니다.",
    "The value of FinalValue is always 5.": "FinalValue의 값은 항상 5입니다.",
    "The value of the FinalValue will be greater than 5.": "FinalValue의 값은 5보다 큽니다.",
    "When the Integer field, is filled with a Text value.": "정수 필드가 텍스트 값으로 채워진 경우.",
    "When all non-mandatory fields are not filled.": "필수 항목이 아닌 모든 필드가 채워지지 않은 경우.",
    "When the date filed is filled with an Integer value.": "날짜 필드가 정수 값으로 채워진 경우.",
    "When some of the mandatory fields are not filled.": "일부 필수 필드가 채워지지 않은 경우.",
    "Make the datatype the primary key of the User entity to UserDetail Identifier.": "User 엔티티의 기본 키 데이터 유형을 UserDetail 식별자로 만듭니다.",
    "Add a new attribute in UserDetail and make its data type User Identifier.": "UserDetail에 새 속성을 추가하고 데이터 유형을 User 식별자로 만듭니다.",
    "Add a new attribute in User and make its data type as UserDetail Identifier.": "User에 새 속성을 추가하고 데이터 유형을 UserDetail 식별자로 만듭니다.",
    "Make the Datatype of the primary key of the UserDetail entity to User Identifier.": "UserDetail 엔티티의 기본 키 데이터 유형을 User 식별자로 만듭니다.",
    "ListIndexOf": "ListIndexOf",
    "ListFilter": "ListFilter",
    "ListAny": "ListAny",
    "ListContains": "ListContains",
    "Structure": "Structure",
    "List": "List",
    "Entity Identifier": "Entity Identifier",
    "Binary": "Binary",
    "Object": "객체",
    "Map": "맵",
    "Collection": "컬렉션",
    "Enumeration": "열거형(Enumeration)",
    "It can be set to an external URL": "외부 URL로 설정할 수 있습니다.",
    "It can be set to any screen in scope.": "범위 내의 모든 화면으로 설정할 수 있습니다.",
    "It can be set to public client action.": "공용 클라이언트 액션으로 설정할 수 있습니다.",
    "It can be set to the current screen.": "현재 화면으로 설정할 수 있습니다.",
    "By setting it to yes, it would be publicly available": "Yes로 설정하면 공개적으로 사용할 수 있습니다.",
    "By setting it no, it would be available to consumer modules.": "No로 설정하면 Consumer 모듈에서 사용할 수 있습니다.",
    "Its scope will be global by setting it Yes": "Yes로 설정하면 범위가 전역이 됩니다.",
    "By setting yes, it would be available to call from Expression Editor": "Yes로 설정하면 Expression 에디터에서 호출할 수 있습니다.",
    "It is available on the client side": "클라이언트 측에서 사용할 수 있습니다.",
    "Records can be created at run time": "런타임에 레코드를 생성할 수 있습니다.",
    "It can be created at the time of development": "개발 시점에 생성할 수 있습니다.",
    "It contains records": "레코드를 포함합니다.",
    "Only Read Only Entity Identifier can be used as a reference attribute": "읽기 전용 엔티티 식별자만 참조 속성으로 사용할 수 있습니다.",
    "It would be exposed as read-only to the consumer modules.": "Consumer 모듈에 읽기 전용으로 노출됩니다.",
    "It is useless property": "쓸모없는 속성입니다.",
    "It would not allow to write anything in entity.": "엔티티에 아무것도 쓸 수 없도록 합니다.",
    "Form Valid property has to be checked before adding the data to the database.": "데이터베이스에 데이터를 추가하기 전에 Form Valid 속성을 확인해야 합니다.",
    "Form Valid property has to be set to false in the action flow.": "액션 흐름에서 Form Valid 속성을 false로 설정해야 합니다.",
    "Nothing. Since the built-in validation is set to true.": "아무것도 하지 않습니다. 내장 유효성 검사가 true로 설정되어 있기 때문입니다.",
    "Appropriate logic should be written before sending data to the server.": "데이터를 서버로 보내기 전에 적절한 로직을 작성해야 합니다.",
    "None Of Above": "해당 사항 없음",
    "No authentication is required.": "인증이 필요하지 않습니다.",
    "Only users with valid credentials can access this screen.": "유효한 자격 증명이 있는 사용자만 이 화면에 액세스할 수 있습니다.",
    "Only users registered with the application can access this screen.": "애플리케이션에 등록된 사용자만 이 화면에 액세스할 수 있습니다.",
    "Aggregate is first and then Data action": "Aggregate가 먼저이고 그 다음이 데이터 액션입니다.",
    "Data action will be executed on start and aggregate will be on demand.": "데이터 액션은 시작 시 실행되고 Aggregate는 필요할 때 실행됩니다.",
    "Data Action is first and then Aggregate.": "데이터 액션이 먼저이고 그 다음이 Aggregate입니다.",
    "Both will be executed asynchronously.": "둘 다 비동기적으로 실행됩니다.",
    "Create a new entity User_Group and put the identifier of both user and group in the newly created entity.": "새 엔티티 User_Group을 생성하고 새로 생성된 엔티티에 사용자 및 그룹 식별자를 모두 넣습니다.",
    "Create an attribute in Group with datatype as the User identifier.": "데이터 유형이 User 식별자인 속성을 Group에 생성합니다.",
    "Create only with join in between them.": "둘 사이에 조인만 생성합니다.",
    "Create an attribute in User with datatype as Group identifier.": "데이터 유형이 Group 식별자인 속성을 User에 생성합니다.",
    "Entities = Tables": "엔티티 = 테이블",
    "Attributes = Columns": "속성 = 컬럼",
    "Referential attribute = Primary Key": "참조 속성 = 기본 키(Primary Key)",
    "Index = Index": "인덱스 = 인덱스",
    "The output of server action.": "서버 액션의 출력.",
    "Both output of server action and output of data action on the screen.": "서버 액션의 출력과 화면의 데이터 액션 출력 모두.",
    "The output of data action on the screen.": "화면의 데이터 액션 출력.",
    "addition formula of two local integer variables present on the screen.": "화면에 있는 두 로컬 정수 변수의 덧셈 공식.",
    "We can redirect to the outside of the OutSystems application on the OnClick of button": "버튼의 OnClick 시 OutSystems 애플리케이션 외부로 리디렉션할 수 있습니다.",
    "We can refresh the current screen on the Button's onClick event": "버튼의 onClick 이벤트에서 현재 화면을 새로 고칠 수 있습니다.",
    "We can navigate to another screen on the button's onClick event.": "버튼의 onClick 이벤트에서 다른 화면으로 이동할 수 있습니다.",
    "We can call a server action on the button's OnClick event": "버튼의 OnClick 이벤트에서 서버 액션을 호출할 수 있습니다.",
    "It would only be defined with only one input parameter.": "하나의 입력 매개변수만 정의될 수 있습니다.",
    "It would only be defined with only one output parameter.": "하나의 출력 매개변수만 정의될 수 있습니다.",
    "We would not be able to use this server action from another module.": "다른 모듈에서 이 서버 액션을 사용할 수 없습니다.",
    "It would only be used inside expressions.": "Expression 내부에서만 사용됩니다.",
    "An event is required to notify all the other instances about the changes made in the block.": "블록의 변경 사항을 다른 모든 인스턴스에 알리려면 이벤트가 필요합니다.",
    "It requires an event to fire every time when there is any change in the web block to reflect it on its instance.": "인스턴스에 반영하기 위해 web block에 변경 사항이 있을 때마다 이벤트가 발생해야 합니다.",
    "Changes made in the web block will automatically reflect in all its instances.": "web block의 변경 사항은 자동으로 모든 인스턴스에 반영됩니다.",
    "The change has to be done manually on each instance of the block": "변경 사항은 블록의 각 인스턴스에서 수동으로 수행되어야 합니다.",
    "Blocks can be instantiated on Screens and other Blocks": "블록은 화면 및 다른 블록에서 인스턴스화될 수 있습니다.",
    "Blocks can only be instantiated on Screens": "블록은 화면에서만 인스턴스화될 수 있습니다.",
    "Blocks can be instantiated on Screens and external HTML pages, using a special HTML tag.": "특수 HTML 태그를 사용하여 화면 및 외부 HTML 페이지에서 블록을 인스턴스화할 수 있습니다.",
    "Blocks can be instantiated on Client Actions on the Screen.": "화면의 클라이언트 액션에서 블록을 인스턴스화할 수 있습니다.",
    "It returns the Id only when a new record is created.": "새 레코드가 생성될 때만 Id를 반환합니다.",
    "It only returns Id only when NullIdentifier() in Id is passed while calling the action.": "액션을 호출할 때 Id에 NullIdentifier()가 전달된 경우에만 Id를 반환합니다.",
    "It returns Id as well as a record that is updated or created.": "업데이트되거나 생성된 레코드와 Id를 함께 반환합니다.",
    "It returns only the ID of the created or updated record.": "생성되거나 업데이트된 레코드의 ID만 반환합니다.",
    "Aggregates and DataActions execute in the same order as they are defined on the screen.": "애그리게이트와 DataAction은 화면에 정의된 순서와 동일하게 실행됩니다.",
    "We need to call aggregates and DataAction explicitly": "애그리게이트와 DataAction을 명시적으로 호출해야 합니다.",
    "DataAction executes before the aggregates.": "DataAction은 애그리게이트보다 먼저 실행됩니다.",
    "There is no order of aggregates and DataAction execution": "애그리게이트와 DataAction의 실행 순서가 없습니다.",
    "All of above": "위의 모든 사항",
    "Screen actions can not have output.": "화면 액션(Screen actions)은 출력을 가질 수 없습니다.",
    "Screen actions can not be called from outside of the screen": "화면 액션은 화면 외부에서 호출할 수 없습니다.",
    "Screen actions can not be called from client actions.": "화면 액션은 클라이언트 액션에서 호출할 수 없습니다."
  }
}